Autodesk.Revit.UI.TemporaryGraphicsCommandData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.TemporaryGraphicsCommandData.Index
The unique index of the temporary graphics object managed by Autodesk.Revit.DB.TemporaryGraphicsManager.
Since:
2022

Autodesk.Revit.UI.TemporaryGraphicsCommandData.Document
The document.
Since:
2022

Autodesk.Revit.UI.TemporaryGraphicsCommandData.#ctor
Since:
2022

Autodesk.Revit.UI.TemporaryGraphicsCommandData
The context data that can be provided to Autodesk.Revit.UI.ITemporaryGraphicsHandler.OnClick(Autodesk.Revit.UI.TemporaryGraphicsCommandData).
Since:
2022